#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_buckets.aws_s3_bucket.curated_bucket will be created
  + resource "aws_s3_bucket" "curated_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "stg-rublaman-curated-s3"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "stg"
          + "Name"        = "stg-rublaman-curated-s3"
          + "Project"     = "rublaman"
          + "Type"        = "curated"
        }
      + tags_all                    = {
          + "Environment" = "stg"
          + "Name"        = "stg-rublaman-curated-s3"
          + "Project"     = "rublaman"
          + "Type"        = "curated"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_buckets.aws_s3_bucket.landing_bucket will be created
  + resource "aws_s3_bucket" "landing_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "stg-rublaman-landing-s3"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "stg"
          + "Name"        = "stg-rublaman-landing-s3"
          + "Project"     = "rublaman"
          + "Type"        = "landing"
        }
      + tags_all                    = {
          + "Environment" = "stg"
          + "Name"        = "stg-rublaman-landing-s3"
          + "Project"     = "rublaman"
          + "Type"        = "landing"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_buckets.aws_s3_bucket.raw_bucket will be created
  + resource "aws_s3_bucket" "raw_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "stg-rublaman-raw-s3"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "stg"
          + "Name"        = "stg-rublaman-raw-s3"
          + "Project"     = "rublaman"
          + "Type"        = "raw"
        }
      + tags_all                    = {
          + "Environment" = "stg"
          + "Name"        = "stg-rublaman-raw-s3"
          + "Project"     = "rublaman"
          + "Type"        = "raw"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_buckets.aws_s3_bucket.ready_bucket will be created
  + resource "aws_s3_bucket" "ready_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-rublaman-ready-s3"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "stg"
          + "Name"        = "dev-rublaman-ready-s3"
          + "Project"     = "rublaman"
          + "Type"        = "ready"
        }
      + tags_all                    = {
          + "Environment" = "stg"
          + "Name"        = "dev-rublaman-ready-s3"
          + "Project"     = "rublaman"
          + "Type"        = "ready"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_buckets.aws_s3_bucket_public_access_block.curated_bucket_access will be created
  + resource "aws_s3_bucket_public_access_block" "curated_bucket_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_buckets.aws_s3_bucket_public_access_block.landing_bucket_access will be created
  + resource "aws_s3_bucket_public_access_block" "landing_bucket_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_buckets.aws_s3_bucket_public_access_block.raw_bucket_access will be created
  + resource "aws_s3_bucket_public_access_block" "raw_bucket_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_buckets.aws_s3_bucket_public_access_block.ready_bucket_access will be created
  + resource "aws_s3_bucket_public_access_block" "ready_bucket_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_buckets.aws_s3_bucket_versioning.curated_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "curated_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_buckets.aws_s3_bucket_versioning.landing_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "landing_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_buckets.aws_s3_bucket_versioning.raw_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "raw_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_buckets.aws_s3_bucket_versioning.ready_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "ready_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + all_bucket_ids    = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + curated_bucket_id = (known after apply)
  + environment       = "stg"
  + landing_bucket_id = (known after apply)
  + raw_bucket_id     = (known after apply)
  + ready_bucket_id   = (known after apply)
  + region            = "eu-west-3"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>